# Importing needed modules

In [1]:
import pandas as pd
import sqlite3

# Creating a connection to the database

In [2]:
con = sqlite3.connect('Chinook_Sqlite.sqlite')

# A simple query of the database that outputs customer names, track names, and album Titles

In [15]:

#Using Inner Joins since we only want data that is available on both tables
query = '''SELECT customer.lastname, customer.firstname, track.name, album.Title
                              FROM customer
                              INNER JOIN invoice ON customer.CustomerID = invoice.CustomerID
                              INNER JOIN invoiceline ON invoiceline.invoiceID = invoice.invoiceID
                              INNER JOIN track ON invoiceline.trackID = track.trackID
                              INNER JOIN album ON album.albumid = track.albumid
                              ORDER BY customer.LastName, customer.Firstname'''

In [18]:
data = pd.read_sql(query, con)

In [19]:
data

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas
...,...,...,...,...
2235,Zimmermann,Fynn,Nothin' To Lose,Unplugged [Live]
2236,Zimmermann,Fynn,Since I've Been Loving You,BBC Sessions [Disc 2] [Live]
2237,Zimmermann,Fynn,Going To California,BBC Sessions [Disc 2] [Live]
2238,Zimmermann,Fynn,We're Gonna Groove,Coda
2239,Zimmermann,Fynn,Ozone Baby,Coda

In [20]:
data.head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas